html/python/lispy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>用Python实现一个更好的Lisp解释器</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="content">
<h1 class="title">用Python实现一个更好的Lisp解释器</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org70b3760">数据类型：字符串，布尔值，复数，端口</a></li>
<li><a href="#orga2226b8">新增语法: 字符串，注释，引用，#常量</a>
<ul>
<li><a href="#org472abf8">InputPort 类</a></li>
<li><a href="#orgfaa9463">readchar  和 readport</a></li>
<li><a href="#org2504d93">token -&gt; 原始数据类型</a></li>
<li><a href="#org40332b4">加强版 repl</a></li>
<li><a href="#org31eb8ee">测试</a></li>
</ul>
</li>
<li><a href="#org7deab8f">宏</a></li>
<li><a href="#org91593f8">尾递归</a></li>
<li><a href="#org0fa467e">续延</a></li>
<li><a href="#orga1ca3b4">不定长函数参数</a></li>
<li><a href="#org7aa3a40">语法检查</a></li>
<li><a href="#orgbb299c8">更多原始过程</a></li>
<li><a href="#orged230b2">测试</a></li>
</ul>
</div>
</div>
<p>
<a href="http://norvig.com/lispy.html">这篇博客</a> 展示了如何在90行Python代码实现一个简单的Lisp解释器：<a href="https://github.com/klose911/klose911.github.io/blob/master/src/python/src/lisp/lis.py">lis.py</a> 。<a href="https://github.com/klose911/klose911.github.io/blob/master/src/python/src/lisp/lispy.py">lispy.py</a> 这个版本做了一些新的扩展，虽然代码量是原来的三倍左右，但这是一个更完整的 Lisp 实现
</p>
<div id="outline-container-org70b3760" class="outline-2">
<h2 id="org70b3760">数据类型：字符串，布尔值，复数，端口</h2>
<div class="outline-text-2" id="text-org70b3760">
<pre class="example">
    增加一个新的数据类型可能有三个地方需要修改：

    数据类型的内部表达方式
    对这些数据类型的操作
    读取新的数据类型的语法
</pre>

<p>
下面是增加的四种数据类型：
</p>
<ol class="org-ol">
<li>字符串：使用 <span class="underline">双引号</span> 扩起来的。在一个字符串中， <b>\n</b> 代表着一个 <span class="underline">新行</span> ， <b>\"</b> 表示一个 <span class="underline">双引号</span></li>
<li>布尔值： 
<ul class="org-ul">
<li><span class="underline">True</span> 和 <span class="underline">False</span> 的语法是： <b>#t</b> 和 <b>#f</b></li>
<li>类型判断过程： <b>boolean?</b></li>
</ul></li>
<li>复数：使用 <b>cmath</b> 模块 替换 <span class="underline">math</span> 模块来支付复数。这样可以用 <span class="underline">3+4i</span> 来表达复数常量</li>
<li>端口：没有语法需要添加，但是需要新增 <span class="underline">port?</span> ,  <span class="underline">load</span> ,  <span class="underline">open-input-file</span> ,  <span class="underline">close-input-port</span> ,  <span class="underline">open-output-file</span> ,  <span class="underline">close-output-port</span> , <span class="underline">read</span> ,  <span class="underline">read-char</span> ,  <span class="underline">write</span>  and <span class="underline">display</span> 
<ul class="org-ul">
<li>输出端口：使用 Python <span class="underline">原生 file 对象</span> 来表达</li>
<li>输入端口：包装在一个 <b>InputPort</b> 类，这个类包含 <span class="underline">被读的 file 对象</span> 和 <span class="underline">最后被读的那一行</span></li>
</ul></li>
</ol>
<pre class="example">
这四种新的数据结构，除了输入端口用了新实现的 InputPort 类，其他都使用了 Python 原生的数据结构

InputPort 类更加方便，因为 Scheme 输入端口不仅需要处理读取表达式，而且需要读取字符
与之相比原来的 tokenizer 只能处理一个完整行，而不是单独的字符
</pre>

<p>
同时还有一种老的数据类型独立出来：
</p>
<ul class="org-ul">
<li>符号：在上一个版本的解释器中，符号被实现为字符串。为了和新增加的字符串类型作为区别，符号被实现为一个新的类 <b>Symbol</b> ，直接继承于 <span class="underline">str</span> 类</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">Symbol</span>(<span style="color: #f08080;">str</span>): <span style="color: #00bfff; font-weight: bold;">pass</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">Sym</span>(s, symbol_table={}):
<span style="background-color: #405060;"> </span>   <span style="color: #ffebcd;">"Find or create unique Symbol entry for str s in symbol table."</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">if</span> s <span style="color: #00bfff; font-weight: bold;">not</span> <span style="color: #00bfff; font-weight: bold;">in</span> symbol_table: <span style="color: #4eee94;">symbol_table</span>[s] = Symbol(s)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> symbol_table[s]

_quote, _if, _set, _define, _lambda, _begin, _definemacro, = <span style="color: #f08080;">map</span>(Sym, 
<span style="color: #deb887;">"quote   if   set!  define   lambda   begin   define-macro"</span>.split())

<span style="color: #4eee94;">_quasiquote</span>, <span style="color: #4eee94;">_unquote</span>, <span style="color: #4eee94;">_unquotesplicing</span> = <span style="color: #f08080;">map</span>(Sym,
<span style="color: #deb887;">"quasiquote   unquote   unquote-splicing"</span>.split())
</pre>
</div>

<pre class="example">
    现在无法再使用 x[0] == 'if' ，因为 if 现在是一个字符串，而不是 Symbol 对象

    相应地定义 _if 为 Sym('if') ，用 x[0] == _if 来做判断
    其中 Sym 函数管理了一个 没有重复的符号表 ：symbol_table 
</pre>
</div>
</div>
<div id="outline-container-orga2226b8" class="outline-2">
<h2 id="orga2226b8">新增语法: 字符串，注释，引用，#常量</h2>
<div class="outline-text-2" id="text-orga2226b8">
<ul class="org-ul">
<li>增加字符串类型以后使得标记化过程变得复杂。现在无法再使用 <span class="underline">空白符</span> 来分割标记，因为 <b>空白符同样会出现在字符串中</b> 。相应地需要使用复杂的 <b>正则表达式</b> 来把输入解析成标记</li>
<li>在 Scheme 中 <span class="underline">注释</span> 是以' <b>;</b> '开头直到行尾。，必须把从' <b>;</b> '开头直到行尾收集到一个标记中，并且忽略到这个标记</li>
<li>还需要支持6中新的标记： 
<ul class="org-ul">
<li><b>#t</b> : <span class="underline">True</span> 常量</li>
<li><b>#f</b> : <span class="underline">False</span> 常量</li>
<li><b>'</b> : <b>引用</b> ( <span class="underline">quote</span> ) 后面的表达式，例如 <span class="underline">'exp</span> 等价于 <span class="underline">(quote exp)</span></li>
<li><b>`</b> : <b>准引用</b> ( <span class="underline">quasiquote</span> ) 后面的表达式 
<ul class="org-ul">
<li><span class="underline">准引用</span> 是 <b>运行时获得值</b> ，而 <span class="underline">引用</span> 是 <b>编译时值已经确定</b> ，因此 <span class="underline">准引用</span> 可以 <b>包含变量</b> ，如果需要这个变量会在运行时被替换：
<ul class="org-ul">
<li><b>,</b> : <span class="underline">,exp</span> 表示 exp 是个 <span class="underline">变量</span> ，替换这个 exp <span class="underline">变量的值</span></li>
<li><b>,@</b> : <span class="underline">,@exp</span> 表示 exp 是个 <span class="underline">列表</span> ，用这个 <span class="underline">列表中所有的元素</span> 来做替换</li>
</ul></li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">a</span> 1<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">b</span> 2<span style="color: #696969;">)</span>

'<span style="color: #696969;">(</span>a b<span style="color: #696969;">)</span>                          <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (a b) </span>
`<span style="color: #696969;">(</span>a b<span style="color: #696969;">)</span>                          <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; '(a b)</span>

`<span style="color: #696969;">(</span>a ,b<span style="color: #696969;">)</span>                         <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; '(a 2), a &#20381;&#26087;&#26159;&#37027;&#20010;&#21464;&#37327; a</span>
<span style="color: #696969;">(</span>quasiquote <span style="color: #696969;">(</span>a <span style="color: #696969;">(</span>unquote b<span style="color: #696969;">)))</span>    <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; '(a 2), &#21644; `(a ,b) &#31561;&#20215;</span>

`<span style="color: #696969;">(</span>,a ,b<span style="color: #696969;">)</span>                        <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; '(1 2)</span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">c</span> '<span style="color: #696969;">(</span>3 4 5<span style="color: #696969;">))</span>
`<span style="color: #696969;">(</span>,b ,@c<span style="color: #696969;">)</span>                       <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (2 3 4 5) </span>
</pre>
</div>
</div>

<div id="outline-container-org472abf8" class="outline-3">
<h3 id="org472abf8">InputPort 类</h3>
<div class="outline-text-3" id="text-org472abf8">
<p>
引入 InputPort 类之后使得 repl 循环变得更加强大：
</p>
<ul class="org-ul">
<li>支持多行读取</li>
<li>错误检查和打印</li>
</ul>

<p>
下面是 InputPort 的实现：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">class</span> <span style="color: #98f5ff;">InPort</span>(<span style="color: #f08080;">object</span>):
<span style="background-color: #405060;"> </span>   <span style="color: #ffebcd;">"An input port. Retains a line of chars."</span>
<span style="background-color: #405060;"> </span>   <span style="color: #4eee94;">tokenizer</span> = r<span style="color: #deb887;">"""\s*(,@|[('`,)]|"(?:[\\].|[^\\"])*"|;.*|[^\s('"`,;)]*)(.*)"""</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">__init__</span>(<span style="color: #00bfff; font-weight: bold;">self</span>, <span style="color: #f08080;">file</span>):
        <span style="color: #00bfff; font-weight: bold;">self</span>.<span style="color: #f08080;">file</span> = <span style="color: #f08080;">file</span>; <span style="color: #00bfff; font-weight: bold;">self</span>.line = <span style="color: #deb887;">""</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">next_token</span>(<span style="color: #00bfff; font-weight: bold;">self</span>):
        <span style="color: #ffebcd;">"Return the next token, reading new text into line buffer if needed."</span>
        <span style="color: #00bfff; font-weight: bold;">while</span> <span style="color: #ffd700;">True</span>:
            <span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #00bfff; font-weight: bold;">self</span>.line == <span style="color: #deb887;">""</span>: <span style="color: #00bfff; font-weight: bold;">self</span>.line = <span style="color: #00bfff; font-weight: bold;">self</span>.<span style="color: #f08080;">file</span>.readline()
            <span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #00bfff; font-weight: bold;">self</span>.line == <span style="color: #deb887;">""</span>: <span style="color: #00bfff; font-weight: bold;">return</span> eof_object
            <span style="color: #4eee94;">token</span>, <span style="color: #00bfff; font-weight: bold;">self</span>.line = re.match(InPort.tokenizer, <span style="color: #00bfff; font-weight: bold;">self</span>.line).groups()
            <span style="color: #00bfff; font-weight: bold;">if</span> token != <span style="color: #deb887;">''</span> <span style="color: #00bfff; font-weight: bold;">and</span> <span style="color: #00bfff; font-weight: bold;">not</span> token.startswith(<span style="color: #deb887;">';'</span>):
                <span style="color: #00bfff; font-weight: bold;">return</span> token
</pre>
</div>
</div>
</div>
