src/python/lispy.org
** readchar  和 readport 
   #+BEGIN_SRC python 
     eof_object = Symbol('#<eof-object>') # Note: uninterned; can't be read

     def readchar(inport):
	 "Read the next character from an input port."
	 if inport.line != '':
	     ch, inport.line = inport.line[0], inport.line[1:]
	     return ch
	 else:
	     return inport.file.read(1) or eof_object

     quotes = {"'":_quote, "`":_quasiquote, ",":_unquote, ",@":_unquotesplicing}

     def read(inport):
	 "Read a Scheme expression from an input port."
	 def read_ahead(token):
	     if '(' == token: 
		 L = []
		 while True:
		     token = inport.next_token()
		     if token == ')': return L
		     else: L.append(read_ahead(token))
	     elif ')' == token: raise SyntaxError('unexpected )')
	     elif token in quotes: return [quotes[token], read(inport)]
	     elif token is eof_object: raise SyntaxError('unexpected EOF in list')
	     else: return atom(token)
	     # body of read:
	 token1 = inport.next_token()
	 return eof_object if token1 is eof_object else read_ahead(token1)
   #+END_SRC

** token -> 原始数据类型
   #+BEGIN_SRC python
  def atom(token):
      'Numbers become numbers; #t and #f are booleans; "..." string; otherwise Symbol.'
      if token == '#t': return True
      elif token == '#f': return False
      elif token[0] == '"': return token[1:-1].decode('string_escape')
      try: return int(token)
      except ValueError:
	  try: return float(token)
	  except ValueError:
	      try: return complex(token.replace('i', 'j', 1))
	      except ValueError:
		  return Sym(token)
   #+END_SRC

   原始数据类型转换成字符串：
   #+BEGIN_SRC python 
  def to_string(x):
      "Convert a Python object back into a Lisp-readable string."
      if x is True: return "#t"
      elif x is False: return "#f"
      elif isa(x, Symbol): return x
      elif isa(x, str): return '"%s"' % x.encode('string_escape').replace('"',r'\"')
      elif isa(x, list): return '('+' '.join(map(to_string, x))+')'
      elif isa(x, complex): return str(x).replace('j', 'i')
      else: return str(x)
   #+END_SRC
