html/python/lispy.html

<div id="outline-container-orgfaa9463" class="outline-3">
<h3 id="orgfaa9463">readchar  和 readport</h3>
<div class="outline-text-3" id="text-orgfaa9463">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4eee94;">eof_object</span> = Symbol(<span style="color: #deb887;">'#&lt;eof-object&gt;'</span>) <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">Note: uninterned; can't be read</span>

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">readchar</span>(inport):
<span style="background-color: #405060;"> </span>   <span style="color: #ffebcd;">"Read the next character from an input port."</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">if</span> inport.line != <span style="color: #deb887;">''</span>:
        <span style="color: #4eee94;">ch</span>, <span style="color: #4eee94;">inport.line</span> = inport.line[0], inport.line[1:]
        <span style="color: #00bfff; font-weight: bold;">return</span> ch
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">else</span>:
        <span style="color: #00bfff; font-weight: bold;">return</span> inport.<span style="color: #f08080;">file</span>.read(1) <span style="color: #00bfff; font-weight: bold;">or</span> eof_object

<span style="color: #4eee94;">quotes</span> = {<span style="color: #deb887;">"'"</span>:_quote, <span style="color: #deb887;">"`"</span>:_quasiquote, <span style="color: #deb887;">","</span>:_unquote, <span style="color: #deb887;">",@"</span>:_unquotesplicing}

<span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">read</span>(inport):
<span style="background-color: #405060;"> </span>   <span style="color: #ffebcd;">"Read a Scheme expression from an input port."</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">read_ahead</span>(token):
        <span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #deb887;">'('</span> == token: 
            <span style="color: #4eee94;">L</span> = []
            <span style="color: #00bfff; font-weight: bold;">while</span> <span style="color: #ffd700;">True</span>:
                <span style="color: #4eee94;">token</span> = inport.next_token()
                <span style="color: #00bfff; font-weight: bold;">if</span> token == <span style="color: #deb887;">')'</span>: <span style="color: #00bfff; font-weight: bold;">return</span> L
                <span style="color: #00bfff; font-weight: bold;">else</span>: L.append(read_ahead(token))
        <span style="color: #00bfff; font-weight: bold;">elif</span> <span style="color: #deb887;">')'</span> == token: <span style="color: #00bfff; font-weight: bold;">raise</span> <span style="color: #98f5ff;">SyntaxError</span>(<span style="color: #deb887;">'unexpected )'</span>)
        <span style="color: #00bfff; font-weight: bold;">elif</span> token <span style="color: #00bfff; font-weight: bold;">in</span> quotes: <span style="color: #00bfff; font-weight: bold;">return</span> [quotes[token], read(inport)]
        <span style="color: #00bfff; font-weight: bold;">elif</span> token <span style="color: #00bfff; font-weight: bold;">is</span> eof_object: <span style="color: #00bfff; font-weight: bold;">raise</span> <span style="color: #98f5ff;">SyntaxError</span>(<span style="color: #deb887;">'unexpected EOF in list'</span>)
        <span style="color: #00bfff; font-weight: bold;">else</span>: <span style="color: #00bfff; font-weight: bold;">return</span> atom(token)
        <span style="color: #5f9ea0; font-style: italic;"># </span><span style="color: #5f9ea0; font-style: italic;">body of read:</span>
<span style="background-color: #405060;"> </span>   <span style="color: #4eee94;">token1</span> = inport.next_token()
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">return</span> eof_object <span style="color: #00bfff; font-weight: bold;">if</span> token1 <span style="color: #00bfff; font-weight: bold;">is</span> eof_object <span style="color: #00bfff; font-weight: bold;">else</span> read_ahead(token1)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2504d93" class="outline-3">
<h3 id="org2504d93">token -&gt; 原始数据类型</h3>
<div class="outline-text-3" id="text-org2504d93">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">atom</span>(token):
<span style="background-color: #405060;"> </span>   <span style="color: #ffebcd;">'Numbers become numbers; #t and #f are booleans; "..." string; otherwise Symbol.'</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">if</span> token == <span style="color: #deb887;">'#t'</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #ffd700;">True</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> token == <span style="color: #deb887;">'#f'</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #ffd700;">False</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> token[0] == <span style="color: #deb887;">'"'</span>: <span style="color: #00bfff; font-weight: bold;">return</span> token[1:-1].decode(<span style="color: #deb887;">'string_escape'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">try</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #f08080;">int</span>(token)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">except</span> <span style="color: #98f5ff;">ValueError</span>:
        <span style="color: #00bfff; font-weight: bold;">try</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #f08080;">float</span>(token)
        <span style="color: #00bfff; font-weight: bold;">except</span> <span style="color: #98f5ff;">ValueError</span>:
            <span style="color: #00bfff; font-weight: bold;">try</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #f08080;">complex</span>(token.replace(<span style="color: #deb887;">'i'</span>, <span style="color: #deb887;">'j'</span>, 1))
            <span style="color: #00bfff; font-weight: bold;">except</span> <span style="color: #98f5ff;">ValueError</span>:
                <span style="color: #00bfff; font-weight: bold;">return</span> Sym(token)
</pre>
</div>

<p>
原始数据类型转换成字符串：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bfff; font-weight: bold;">def</span> <span style="color: #daa520; font-weight: bold;">to_string</span>(x):
<span style="background-color: #405060;"> </span>   <span style="color: #ffebcd;">"Convert a Python object back into a Lisp-readable string."</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">if</span> x <span style="color: #00bfff; font-weight: bold;">is</span> <span style="color: #ffd700;">True</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #deb887;">"#t"</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> x <span style="color: #00bfff; font-weight: bold;">is</span> <span style="color: #ffd700;">False</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #deb887;">"#f"</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> isa(x, Symbol): <span style="color: #00bfff; font-weight: bold;">return</span> x
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> isa(x, <span style="color: #f08080;">str</span>): <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #deb887;">'"%s"'</span> % x.encode(<span style="color: #deb887;">'string_escape'</span>).replace(<span style="color: #deb887;">'"'</span>,r<span style="color: #deb887;">'\"'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> isa(x, <span style="color: #f08080;">list</span>): <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #deb887;">'('</span>+<span style="color: #deb887;">' '</span>.join(<span style="color: #f08080;">map</span>(to_string, x))+<span style="color: #deb887;">')'</span>
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">elif</span> isa(x, <span style="color: #f08080;">complex</span>): <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #f08080;">str</span>(x).replace(<span style="color: #deb887;">'j'</span>, <span style="color: #deb887;">'i'</span>)
<span style="background-color: #405060;"> </span>   <span style="color: #00bfff; font-weight: bold;">else</span>: <span style="color: #00bfff; font-weight: bold;">return</span> <span style="color: #f08080;">str</span>(x)
</pre>
</div>
</div>
</div>
